app/controllers/reviews_controller.rb

  def create
    @review = @movie.reviews.new(review_params)
    if @movie.save
---
INSERT INTO "reviews" ("comment", "created_at", "movie_id", "name", "stars", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["comment", "This movie is rad!"], ["created_at", Fri, 17 Oct 2014 02:44:29 UTC +00:00], ["movie_id", 1], ["name", "John"], ["stars", 5], ["updated_at", Fri, 17 Oct 2014 02:44:29 UTC +00:00]]